rikkapro0128/system_node_esp32_iot/src/main.cpp
void pingResponse(AsyncWebServerRequest *request)
{
  String response_str;
  DynamicJsonDocument response_json(200);
  JsonObject payload = response_json.to<JsonObject>();

#ifdef LOGIC
  payload["value"]["btn_1"] = stateDevice[0];
  payload["value"]["btn_2"] = stateDevice[1];
  payload["value"]["btn_3"] = stateDevice[2];
#endif

#ifdef COLOR
  JsonObject color;
  payload["value"]["r"] = colorFultureState[0];
  payload["value"]["g"] = colorFultureState[1];
  payload["value"]["b"] = colorFultureState[2];
  payload["value"]["a"] = colorFultureState[3];
#endif

  payload["uid"] = eeprom.readUserID();
  payload["nodeId"] = eeprom.readNodeID();

  serializeJson(payload, response_str);
  request->send(200, "application/json", response_str);
  response_json.clear();
  payload.clear();
}

void restartEsp(AsyncWebServerRequest *request)
{
  request->send(200, "application/json", "{\"message\":\"ESP RESTARTED\"}");
  ESP.restart();
}

void notFound(AsyncWebServerRequest *request)
{
  request->send(404, "text/plain", "Not found");
}

// [POST]
void linkAppication(AsyncWebServerRequest *request, JsonVariant &json)
{
  if (!json.isNull())
  {
    // if (eeprom.canAccess)
    // {
#ifdef _DEBUG_
    Serial.println("DB Node = " + eeprom.DATABASE_NODE);
    Serial.println("Wifi Status = " + String(WiFi.status()));
#endif
    JsonObject body = json.as<JsonObject>();
    String idUser = body["idUser"];
    String idNode = body["idNode"];
#ifdef _DEBUG_
    Serial.println("Link App: idUser = " + idUser + " - idNode = " + idNode);
#endif
    if (idUser.length() > 0 && idNode.length() > 0)
    {
      bool stateSaveNodeId = eeprom.saveNodeID(idNode);
      bool stateSaveUserId = eeprom.saveUserID(idUser);
      if (stateSaveNodeId && stateSaveUserId)
      {
        clearBufferFirebaseDataAll();
#ifdef _DEBUG_
        Serial.println("--- Start Init New Firebase Stream ---");
#endif
        checkFirebaseInit();
        createNode.clear();
        if (fbdoStream.isStream())
        {
          request->send(200, "application/json", "{\"message\":\"LINK APP HAS BEEN SUCCESSFULLY\"}");
        }
        else
        {
          request->send(400, "application/json", "{\"message\":\"LINK APP HAS BEEN FAIL\"}");
        }
      }
      else
      {
        request->send(500, "application/json", "{\"message\":\"FAILURE SAVE PAYLOADS\"}");
      }
    }
    else
    {
      if (idUser.length() <= 0)
      {
        request->send(400, "application/json", "{\"message\":\"ID USER IS NULL\"}");
      }
      else if (idNode.length() <= 0)
      {
        request->send(400, "application/json", "{\"message\":\"ID NODE IS NULL\"}");
      }
      else
      {
        request->send(400, "application/json", "{\"message\":\"PAYLOAD INVALID\"}");
      }
    }
    // }
    // else
    // {
    //   request->send(500, "application/json", "{\"message\":\"SOMETHING WENT WRONG\"}");
    // }
  }
  else
  {
    request->send(403, "application/json", "{\"message\":\"NOT FOUND PAYLOAD\"}");
  }
}

// [POST]
void addConfiguration(AsyncWebServerRequest *request, JsonVariant &json)
{
  if (!json.isNull())
  {
    JsonObject body = json.as<JsonObject>();

    String ssid = body["ssid"];
    String password = body["password"];
    eeprom.saveSSID(ssid);
    eeprom.savePassword(password);
    // Serial.println("[Save config EEPROM]");
    request->send(200, "application/json", "{\"message\":\"CONFIGURATION WIFI SUCCESSFULLY\"}");
    setupWifiModeStation();
    restartConfigWifi = true;
  }
  else
  {
    request->send(403, "application/json", "{\"message\":\"NOT FOUND PAYLOAD\"}");
  }
}

// [POST]
void resetConfigurationWifi(AsyncWebServerRequest *request)
{
  String ssid = eeprom.readSSID();
  String password = eeprom.readPassword();
#ifdef _DEBUG_
  Serial.println("reset config: wifi = " + ssid + " - password = " + password);
#endif
  if (ssid.length() > 0 && password.length() > 0)
  {
    eeprom.saveSSID("");
    eeprom.savePassword("");
  }
  request->send(200, "application/json", "{\"message\":\"RESET CONFIG SUCCESSFULLY\"}");
}

void resetConfigurationFirebase(AsyncWebServerRequest *request)
{
  String response_str;
  DynamicJsonDocument response_json(200);
  size_t index = 0;

  if (eeprom.saveNodeID(""))
  {
    response_json["list-reset"][index] = "nodeId";
    index++;
  }
  if (eeprom.saveUserID(""))
  {
    response_json["list-reset"][index] = "userId";
    index++;
  }
  eeprom.saveDatabaseUrl("");
  request->send(200, "application/json", "{\"message\":\"RESET CONFIG SUCCESSFULLY\"}");
}

// [GET]
void checkLinkAppication(AsyncWebServerRequest *request)
{
  String nodeID = eeprom.readNodeID();
  String userID = eeprom.readUserID();
#ifdef _DEBUG_
  Serial.println("check link app: nodeID = " + nodeID + " - userID = " + userID);
#endif
  if (nodeID.length() && userID.length())
  {
    String response_str;
    DynamicJsonDocument response_json(200);
    JsonObject payload = response_json.to<JsonObject>();
    payload["nodeID"] = nodeID;
    payload["userID"] = userID;
    payload["message"] = "CONFIG IS FOUND";
    serializeJson(payload, response_str);
    request->send(200, "application/json", response_str);
    response_json.clear();
  }
  else
  {
    request->send(403, "application/json", "{\"message\":\"CONFIG NOT FOUND\"}");
  }
}

// [GET]
void checkConfiguration(AsyncWebServerRequest *request)
{
  String ssid = eeprom.readSSID();
  String password = eeprom.readPassword();
#ifdef _DEBUG_
  Serial.println("check config: ssid = " + ssid + " - password = " + password);
#endif
  if (ssid.length() > 0 && password.length() > 0)
  {
    String response_str;
    DynamicJsonDocument response_json(200);
    JsonObject payload = response_json.to<JsonObject>();
    payload["ssid"] = ssid;
    payload["password"] = password;
    payload["ip-station"] = WiFi.localIP();
    payload["status-station"] = WiFi.status();
    payload["quality-station"] = WiFi.RSSI();
    payload["message"] = "WIFI HAS BEEN CONFIG";
    serializeJson(payload, response_str);
    request->send(200, "application/json", response_str);
    response_json.clear();
  }
  else
  {
    request->send(200, "application/json", "{\"message\":\"WIFI NOT YET CONFIG\"}");
  }
}

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 *   [********* {START} DEFINE FUNCTION DEBUG *********]
 *
 */

#ifdef _DEBUG_

void checkRam()
{
  Serial.printf("Ram size = %d (bytes)\n", ESP.getFreeHeap());
}

